интмаг/src/Documents/ЗаказКлиента/ЗаказКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказКлиента</name>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.Закупки</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиент</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗаказов</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

интмаг/src/Documents/ЗаказКлиента/Forms/ФормаДокумента/Module.bsl
Процедура ТоварыНоменклатураПриИзменении(Элемент)
    // Получаем текущую строку через элементы формы
    ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
    
    Если ТекущаяСтрока = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    Если ТекущаяСтрока.Номенклатура <> Неопределено Тогда
        // Подстановка цены из номенклатуры
        ТекущаяСтрока.ЦенаПродажи = ТекущаяСтрока.Номенклатура.Цена;
        
        // Установка количества по умолчанию
        Если ТекущаяСтрока.Количество = Неопределено Или ТекущаяСтрока.Количество = 0 Тогда
            ТекущаяСтрока.Количество = 1;
        КонецЕсли;
        
        // Расчет суммы
        ТекущаяСтрока.Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.ЦенаПродажи;
        
        // Обновление отображения
        Элементы.Товары.Обновить();
    КонецЕсли;
КонецПроцедуры
